{
  "architectures": [
    "XLNetLMHeadModel"
  ],
  "attn_type": "bi",
  "bi_data": false,
  "bos_token_id": 14,
  "clamp_len": -1,
  "d_head": 16,
  "d_inner": 1024,
  "d_model": 256,
  "dropout": 0.2,
  "end_n_top": 5,
  "eos_token_id": 14,
  "ff_activation": "gelu",
  "initializer_range": 0.02,
  "language": "selfies",
  "layer_norm_eps": 1e-12,
  "mem_len": null,
  "model_type": "xlnet",
  "n_head": 16,
  "n_layer": 32,
  "ne_dim": 16,
  "ne_format": "sum",
  "ne_type": "float",
  "pad_token_id": 0,
  "reuse_len": null,
  "same_length": false,
  "start_n_top": 5,
  "summary_activation": "tanh",
  "summary_last_dropout": 0.1,
  "summary_type": "last",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 250
    }
  },
  "untie_r": true,
  "use_ne": true,
  "vmax": 1.0,
  "vocab_size": 507
}
